"19 ContributorsTranslationsDanskEspañolPortuguêsBest for Last Lyrics\nWait, do you see my heart on my sleeve?\nIt's been there for days on end\nAnd it's been waitin' for you to open up yours, too\nBaby, come on now, I'm trying to tell you just how\nI'd like to hear the words roll out of your mouth finally\nSay that it's always been me\n\nThat's made you feel a way you've never felt before\nAnd I'm all you need and that you never want more\nThen you'd say all of the right things without a clue\nBut you'd save the best for last like I'm the one for you\n\nYou should know that you're just a temporary fix\nThis is not rooted with you, it don't mean that much to me\nYou're just a filler in the space that happened to be free\nHow dare you think you'd get away with tryin' to play me, yeah?\n\nWhy is it every time I think I've tried my hardest\nIt turns out it ain't enough?\nYou're still not mentioning love\nWhat am I supposed to do to make you want me properly?\nI'm takin' these chances and getting nowhere\nAnd though I'm trying my hardest, you go back to her\nAnd I think that I know things may never change\nI'm still hopin' one day I might hear you say\nSee Adele LiveGet tickets as low as $540You might also like\nI make you feel a way you've never felt before\nAnd I'm all you need and that you never want more\nThen you'd say all of the right things without a clue\nBut you'd save the best for last like I'm the one for you\n\nYou should know that you're just a temporary fix\nThis is not rooted with you, it don't mean that much to me\nYou're just a filler in the space that happened to be free\nHow dare you think you'd get away with tryin' to play me, yeah?\n\nBut, despite the truth that I know\nI find it hard to let go and give up on you\nSeems I love the things you do\nLike the meaner you treat me, more eager I am\nTo persist with this heartbreak of runnin' around\nAnd I will do until I'm findin' myself with you\n\nAnd make you feel a way you've never felt before\nAnd be all you need so that you never want more\nThen you'd say all of the right things without a clue\nAnd you'll be the one for me and me, the one for you\nYeah, yeah, yeah, yeah9Embed"